/*	EQEMu: Everquest Server Emulator
	Copyright (C) 2001-2005 EQEMu Development Team (http://eqemulator.net)

	This program is free software; you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation; version 2 of the License.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY except by those people which sell it, which
	are required to give you total support for your newly bought product;
	without even the implied warranty of MERCHANTABILITY or FITNESS FOR
	A PARTICULAR PURPOSE. See the GNU General Public License for more details.

	You should have received a copy of the GNU General Public License
	along with this program; if not, write to the Free Software
	Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
*/
#ifndef SPDAT_H
#define SPDAT_H

#include "classes.h"
#include "skills.h"

#define SPELL_UNKNOWN 0xFFFF

//some spell IDs
#define SPELL_SUPERIOR_HEALING 9
#define SPELL_GATE 36
#define SPELL_PACIFY 45
#define SPELL_LAY_ON_HANDS 87
#define SPELL_HARM_TOUCH 88				// regular HT (MR resist); Both PCs and NPCs use this
#define SPELL_FEAR 229
#define SPELL_MINOR_ILLUSION 287
#define SPELL_ILLUSION_TREE 601
#define SPELL_CINDAS_CHARISMATIC_CARILLON 708
#define SPELL_CASSINDRAS_CHORUS_OF_CLARITY 723
#define SPELL_RESURRECTION_EFFECTS 756
#define SPELL_DRAGON_CHARM 841

#define SE_FcDamagePctCrit				302	// implemented - this seems misnamed?  seems to be a spell dmg multiplier that works on everything, not just crits; only used for SK Soul Abrasion AA
#define SE_FcDamageAmtCrit				303	// implemented - adds direct spell damage
#define SE_OffhandRiposteFail			304 // implemented as bonus - enemy cannot riposte offhand attacks
#define SE_MitigateDamageShield			305 // implemented - off hand attacks only (Shielding Resistance)
//#define SE_ArmyOfTheDead				306 // *not implemented NecroAA - This ability calls up to five shades of nearby corpses back to life to serve the necromancer. The soulless abominations will mindlessly fight the target until called back to the afterlife some time later. The first rank summons up to three shades that serve for 60 seconds, and each additional rank adds one more possible shade and increases their duration by 15 seconds
//#define SE_Appraisal					307 // *not implemented Rogue AA - This ability allows you to estimate the selling price of an item you are holding on your cursor.
#define SE_SuspendMinion				308 // implemented
#define SE_GateCastersBindpoint			309 // implemented - Gate to casters bind point
#define SE_ReduceReuseTimer				310 // implemented
#define SE_LimitCombatSkills			311 // implemented - Excludes focus from procs (except if proc is a memorizable spell)
#define SE_ShieldBlock					320	// unsued; well after PoP
#define SE_HeadShotLevel				346	// implemented[AA] - HeadShot max level to kill
#define SE_LimitSpellGroup				385	// implemented - Limits to spell group(ie type 3 reuse reduction augs that are class specific and thus all share s SG)
#define SE_FinishingBlowLvl				440 // implemented[AA] - Sets the level Finishing blow can be triggered on an NPC
// LAST


#define DF_Permanent			50

// Disciplines
#define disc_aggressive					1
#define disc_precision					2
#define disc_defensive					3
#define disc_evasive					4
#define disc_ashenhand					5
#define disc_furious					6  //whirlwind, counterattack
#define disc_stonestance				11 //protectivespirit
#define disc_thunderkick				12
#define disc_fortitude					13 //voiddance
#define disc_fellstrike					14 //bestialrage, innerflame, duelist
#define disc_hundredfist				15 //blindingspeed
#define disc_charge						16 //deadeye
#define disc_mightystrike				17
#define disc_nimble						19
#define disc_silentfist					20
#define disc_kinesthetics				21
#define disc_holyforge					22
#define disc_sanctification				23
#define disc_trueshot					24
#define disc_weaponshield				25
#define disc_unholyaura					26
#define disc_leechcurse					27
#define disc_deftdance					28
#define disc_puretone					29
#define disc_resistant					30
#define disc_fearless					31

// solar: note this struct is historical, we don't actually need it to be
// aligned to anything, but for maintaining it it is kept in the order that
// the fields in the text file are. the numbering is not offset, but field
// number. note that the id field is counted as 0, this way the numbers
// here match the numbers given to sep in the loading function net.cpp
//
#define SPELL_LOAD_FIELD_COUNT 186

struct SPDat_Spell_Struct
{
/* 000 */	int id;	// not used
/* 001 */	char name[64]; // Name of the spell
/* 002 */	char player_1[32]; // "PLAYER_1"
/* 003 */	char teleport_zone[64];	// Teleport zone, pet name summoned, or item summoned
/* 004 */	char you_cast[64]; // Message when you cast
/* 005 */	char other_casts[64]; // Message when other casts
/* 006 */	char cast_on_you[64]; // Message when spell is cast on you
/* 007 */	char cast_on_other[64]; // Message when spell is cast on someone else
/* 008 */	char spell_fades[64]; // Spell fades
/* 009 */	float range;
/* 010 */	float aoerange;
/* 011 */	float pushback;
/* 012 */	float pushup;
/* 013 */	uint32 cast_time; // Cast time
/* 014 */	uint32 recovery_time; // Recovery time
/* 015 */	uint32 recast_time; // Recast same spell time
/* 016 */	uint32 buffdurationformula;
/* 017 */	uint32 buffduration;
/* 018 */	uint32 AEDuration;	// sentinel, rain of something
/* 019 */	uint16 mana; // Mana Used
/* 020 */	int base[EFFECT_COUNT];	//various purposes
/* 032 */	int base2[EFFECT_COUNT]; //various purposes
/* 044 */	int32 max[EFFECT_COUNT];
/* 056 */	uint16 icon; // Spell icon
/* 057 */	uint16 memicon; // Icon on membarthing
/* 058 */	int32 components[4]; // reagents
/* 062 */	int component_counts[4]; // amount of regents used
/* 066 */	int NoexpendReagent[4];	// focus items (Need but not used; Flame Lick has a Fire Beetle Eye focus.)
											// If it is a number between 1-4 it means components[number] is a focus and not to expend it
											// If it is a valid itemid it means this item is a focus as well
/* 070 */	uint16 formula[EFFECT_COUNT]; // Spell's value formula
/* 082 */	int LightType; // probaly another effecttype flag
/* 083 */	int8 goodEffect; //0=detrimental, 1=Beneficial, 2=Beneficial, Group Only
/* 084 */	int Activated; // probably another effecttype flag
/* 085 */	int resisttype;
/* 086 */	int effectid[EFFECT_COUNT];	// Spell's effects
/* 098 */	SpellTargetType targettype;	// Spell's Target
/* 099 */	int basediff; // base difficulty fizzle adjustment
/* 100 */	EQ::skills::SkillType skill;
/* 101 */	int8 zonetype; // 01=Outdoors, 02=dungeons, ff=Any
/* 102 */	int8 EnvironmentType;
/* 103 */	int8 TimeOfDay;
/* 104 */	uint8 classes[Class::PLAYER_CLASS_COUNT]; // Classes, and their min levels
/* 119 */	uint8 CastingAnim;
/* 120 */	uint8 TargetAnim;
/* 121 */	uint32 TravelType;
/* 122 */	uint16 SpellAffectIndex;
/* 123 */	int8 disallow_sit; // 124: high-end Yaulp spells (V, VI, VII, VIII [Rk 1, 2, & 3], & Gallenite's Bark of Fury
/* 124 */	int8 deity_agnostic;// 125: Words of the Skeptic
/* 125 */	int8 deities[16];	// Deity check. 201 - 216 per http://www.eqemulator.net/wiki/wikka.php?wakka=DeityList
										// -1: Restrict to Deity; 1: Restrict to Deity, but only used on non-Live (Test Server "Blessing of ...") spells; 0: Don't restrict
/* 141 */	int8 npc_no_cast;	// 142: between 0 & 100
/* 142 */	int8 ai_pt_bonus;	// 143: always set to 0
/* 143 */	int16 new_icon;	// Spell icon used by the client in uifiles/default/spells??.tga, both for spell gems & buff window. Looks to depreciate icon & memicon
/* 144 */	int16 spellanim; // Doesn't look like it's the same as #doanim, so not sure what this is
/* 145 */	int8 uninterruptable;	// Looks like anything != 0 is uninterruptable. Values are mostly -1, 0, & 1 (Fetid Breath = 90?)
/* 146 */	int16 ResistDiff;
/* 147 */	int8 dot_stacking_exempt; // If 1 doesn't stack with self cast by others. If -1 (not implemented) doesn't stack with same effect (???)
/* 148 */	int deletable;
/* 149 */	uint16 RecourseLink;
/* 150 */	bool no_partial_resist;	// 151: -1, 0, or 1
/* 151 */   int8 small_targets_only; // 152 & 153: all set to 0
/* 152 */   int8 use_persistent_particles;
/* 153 */	int8 short_buff_box;	// != 0, goes to short buff box.
/* 154 */	int descnum; // eqstr of description of spell
/* 155 */	int typedescnum; // eqstr of type description
/* 156 */	int effectdescnum; // eqstr of effect description
/* 157 */   int effectdescnum2;
/* 158 */	bool npc_no_los;

/* Below are custom fields for our client*/
/* 159 */	bool reflectable;
/* 160 */	int resist_per_level;
/* 161 */	int resist_cap;
/* 162 */	int EndurCost;
/* 163 */	int8 EndurTimerIndex;
/* 164 */	bool IsDisciplineBuff; //Is a Discipline spell
/* 165 */	int HateAdded;
/* 166 */	int EndurUpkeep;
/* 167 */	int pvpresistbase;
/* 168 */	int pvpresistcalc;
/* 169 */	int pvpresistcap;
/* 170 */	int spell_category;
/* 171 */	int pvp_duration;
/* 172 */	int pvp_duration_cap;
/* 173 */	bool cast_not_standing;
/* 174 */	int8 can_mgb; // 0=no, -1 or 1 = yes
/* 175 */	int dispel_flag;
/* 176 */	int npc_category;
/* 177 */	int npc_usefulness;
/* 178 */	bool wear_off_message;
/* 179 */	bool suspendable; // buff is suspended in suspended buff zones
/* 180 */	int spellgroup;
/* 181 */	bool allow_spellscribe;
/* 182 */	bool AllowRest;
/* 183 */	int custom_icon; // Used by spell guide
/* 184 */	bool not_player_spell;
			uint8 DamageShieldType; // This field does not exist in spells_us.txt
			int min_castinglevel;
			bool bardsong;
			int32 poison_counters;
			int32 disease_counters;
			int32 curse_counters;
			bool manatapspell;
			bool hasrecourse;
			bool disabled;
			bool contains_se_currentmana;
};

extern const SPDat_Spell_Struct* spells;
extern int32 SPDAT_RECORDS;

bool IsTargetableAESpell(uint16 spell_id);
bool IsSacrificeSpell(uint16 spell_id);
bool IsLifetapSpell(uint16 spell_id);
bool IsMezSpell(uint16 spell_id);
int16 GetBaseValue(uint16 spell_id, uint16 effect);
bool IsStunSpell(uint16 spell_id);
bool IsSlowSpell(uint16 spell_id);
bool IsHasteSpell(uint16 spell_id);
bool IsHarmonySpell(uint16 spell_id);
bool IsPacifySpell(uint16 spell_id);
bool IsLullSpell(uint16 spell_id);
bool IsMemBlurSpell(uint16 spell_id);
bool IsAEMemBlurSpell(uint16 spell_id);
bool IsCrowdControlSpell(uint16 spell_id);
bool IsPercentalHealSpell(uint16 spell_id);
